## Vocab generated by v2 of the CMU-Cambridge Statistcal
## Language Modeling toolkit.
##
## Includes 298 words ##
Card
Colorful
Games
Inflatable
Lounges
Memory
Toys
Wooden
accessories
accessory
adapters
adjustable
air
and
apparels
apple
armchair
athleisure
avocado
baby
back
bag
balance
balm
bamboo
banana
bands
bath
beanies
beard
beauty
bed
bibs
bike
bird
birgraphies
blankes
blocking
blocks
blue
bluetooth
board
body
books
bottles
bouncer
bounty
bowls
branded
bread
breast
broom
brush
bun
cables
cake
camera
cameras
can
car
care
carrier
cases
cat
chair
charcoal
charge
cheese
children's
chips
cigaratte
cilantro
cleaner
click
clogs
clothes
coconut
coke
collar
comics
computers
controllers
cookbooks
cords
corrector
cover
crop
cross
cup
curtain
cushion
cutie
denim
desk
detergent
devices
dew
diaper
diet
dig
dishwasher
docks
dog
door
dry
dude
eggs
electric
electronic
enamel
excercise
exclusive
exercise
eyelashes
face
feeder
fictional
films
fishing
fitness
flakes
flour
food
fridge
gadgets
game
games
gaming
gate
glass
glasses
gloves
gold
golf
gopro
growth
guards
guava
hari
headphones
high
holder
home
hot
indoor
ingredients
instant
jeans
jewelry
jigsaw
juul
kayak
kitchen
kits
knife
lamp
laptop
legging
lego
light
lights
lip
long
loop
lumbar
machine
maker
makeup
mask
massager
mat
matcha
maternity
mats
mattresses
measuring
memories
men
microsoft
milk
mix
monitor
mop
mountain
mouth
nail
natural
neck
nintendo
novelty
oats
off
oil
onion
opener
orange
organizer
outdoor
oximeter
panel
papers
peel
pen
pendant
pepsi
personal
pet
phone
photo
pieces
pilates
pillow
pins
plant
plants
platinum
play
playsets
polish
pop
portable
posture
potato
powder
power
powerbanks
pregnancy
printers
products
protein
pulse
pump
puzzle
recipe
resistance
rhinestone
ring
rod
rugs
salt
screen
seat
seciruty
security
serum
shade
shape
shoes
shower
silver
smart
sneakers
socket
socks
sofa
solar
sony
speakers
spices
spin
sports
stand
station
stove
stylish
suspense
swing
tactical
tea
that
thriller
throw
tights
tobacco
tomato
tools
top
touch
toys
tracker
trail
tripod
tub
unicorns
usb
vacuum
vegan
waffle
wash
washing
water
wear
wearables
white
wipes
wireless
women
yoga
