## Vocab generated by v2 of the CMU-Cambridge Statistcal
## Language Modeling toolkit.
##
## Includes 1198 words ##
(
((England)
(=haven’t)
(=won’t)
(Go
(He
(I
(I’m
(See
(What
(car)!
(have
(hear,
(near
(noon,
(off)
(on)
(pardon?)
(past)
(present)
(stomach-
,
...
/
1
1.
10
10.
100
101
102
103
104
105
106
107
108
109
11
11.
110
111
112
113
114
115
116
117
118
119
12
12.
120
121
122
123
124
125
126
127
128
129
13
13.
130
131
132
133
134
135
136
137
138
139
14
140
141
142
143
144
145
146
147
148
149
15
150
151
152
153
154
155
156
157
158
159
16
160
161
162
163
164
165
166
167
168
169
17
170
171
172
173
174
175
176
177
178
179
18
180
181
182
183
184
185
186
187
188
189
19
190
191
192
193
194
195
196
197
198
199
2
2.
20
200
2002
201
202
203
204
205
206
207
208
209
21
210
211
212
213
214
215
216
217
218
219
22
220
221
222
223
224
225
226
227
228
229
23
230
231
232
233
234
235
236
237
238
239
24
240
241
242
243
244
245
246
247
248
249
25
250
251
252
253
254
255
256
257
258
259
26
260
261
262
263
264
265
266
267
268
269
27
270
271
272
273
274
275
276
277
278
279
28
280
281
282
283
284
285
286
287
288
289
29
290
291
292
293
294
295
296
297
298
299
3
3.
30
300
301
302
31
32
33
34
35
36
37
38
39
4
4.
40
41
42
43
44
45
46
47
48
49
5
5.
50
51
52
53
54
55
56
57
58
59
6
6.
60
61
62
63
64
65
66
67
68
69
6:30.
7
7.
70
71
72
73
74
75
76
77
78
79
8
8.
80
81
82
83
84
85
86
87
88
89
9
9.
90
91
92
93
94
95
96
97
98
99
</s>
<s>
After
All
American
Are
As
Basic
Bob
Can
Can’t
Close
Command
Comparing
Could
Damn
Did
Disgraceful!
Do
Does
Don’t
End
English
English?
Excuse
Feb.
Five
Get
Give
Go
Good
Hand
Has
Have
He
Help
Here
Hold
How
Hurry
I
I.
If
Iowa
Is
Island”?
It
It’s
I’d
I’ll
I’m
I’ve
Just
Keeping
Lee
Lesson
Let
Let’s
Listen
Look
Looking
May
Milk
Mind
Miss
Most
My
Neither
Never
Nice
Not
OK
ONE
One
Open
Paris?
Perhaps
Pleased
Read
Ridiculous!
Same
See
Sentences
Shanghai
She
Short
Shut
Sit
So
Stand
TV
TV.
Tell
Thank
That
That’s
The
There
There’s
These
They
This
Those
To
To,
Today
Turn
Verb
Verb:
Very
Wait
We
What
What’s
When
Where
Which
Who
Who’s
Why
Will
Would
Yes
You
Your
You‘d
You’ll
You’re
[i]
a
able
about
about?
ache/a
add
address?
afraid
afraid.
again)
again.
agree
all
all.
alphabet.
always
am
am,
an
and
another
any
anything
appearing
are
are,
are;
arrived
arrived.
arrives,
art.
as
ask
asking
assured
at
aunt
back
back.
bad!
bag
bank.
bathroom.
be
be),
be,
be.
be;
beautiful
bed
bedroom.
been
beg
begin
believe
beside
better
better.
big
bird.
birthday
blackboard!
body
book
book.
book?
books
books.
books?
born?
bought
bowl
box
box.
box?
bread/a
break!
breakfast.
bridge
bring
brother
brothers
brush
bus!
bus.
bus?
business!
busy
by
call
called
can
can,
can.
can’t
car
car.
carried
carry
cash.
chair?
chalk/a
chance
change
checked.
children.
cigarette,
cleaning
close
coffee?
cold.
cold/a
color
comb
come
come?
comes,
conditional
continued
cough/a
could
cup
cup.
dancing?
dark.
day
day)
day?
days
deaf
deal
deeper
desk
devote
did
didn’t
difference.
different
difficult
difficult.
dinner.
dinner?
divided
do
do.
do?
does
doesn’t
doing?
don’t
door
door!
door)
door,
door.
door.)
door...
door?
down,
down?
downstairs!
dress.
drink
drinks
due
each
eat)?
eat.
eat?
eight.
embarrassment,
enough
entitled
enumerate
evening,
ever
every
exactly
example
excited!
exciting
explain
expressing
eyes.
famous
fast
faster
fat.
father
father?
fever/a
few
fewer
find
finished
five.
flowers
fond
for
for?
forget
form
found
friend
friend.
from
from?
front
full
game.
gave
get
get:
getting
get’.
girl
girl.
girl?
give
glad
glass.
glasses?
go
go!
going
gone
good
good!
got
gracious!
great
groups.
gun.
had
had,
hair.
half
hall?
hammer.
handy
happy.
has
has,
hat
have
have,
have?
haven’t
have’.
he
he/she/it
headache)
hear
heard
heavens!
help
helping
her
here
here?
him
him.
him?
his
home/on
home?
hope
hopes
hotel.
house
idea.
if
if...
imitate
impossible
in
in!
in?
ing
interested
interrupt
into
irregular
is
is!
is,
is.
is?
it
it!
it.
it?
jacket.
job.
just
keep
kind
know
lady
lake
last
layer
learn
learn.
leave
left
less
lesson
lessons
lessons,
letter
letters
letters.
lift
light
light.
like
likely
lire
listen
listening
lived
long
look
looking
looks
lot
mad
made
make
makes
man
manage
many
match
match?
matches/a
may
may,
me
me!
me.
me?
means
meet
met
methods
mind
mind.
mine.
minute.
minutes
month.
more
morning!
most
much
much.
must
my
myself
name?
near
necessary
need
nervous!
new
news.)
nice
nice.
night)
no
no?
noon
not
not?
now
now.
object
obvious
ocean?
of
of?
off
offer
office.
old
on
on!
once.
one
one’s
only
open
open),
open,
open?
open?)
opened
opened,
opened.
opened?
opening
opening,
opening.
opening?
opens
opinions.
or
other
ought
our
ourselves.
out
out.
outside.
over
over.
own
o’clock.
packets
pair
pardon.
party
party.
past
pencil
pencil.
pencil?
pencils
pencils.
pencils?
pencils?)
people
perfect
phase
phone
pick
picture?
piece
place
please
please!
please.
please?
possibly
pounds
prefer
present
problems.
promise
promise.
promised
pronunciation.
proud
put
quarter
question.
question?
quite
rain.
rather
ready
reason
recording.
red
remember
remember.
remind
report.
reserve
resolve
rice
rice/a
right!
right/behind
room
room)
rules
said
said.
save
say
school.
scientists
scissors/a
sea/on
seconds
see
seen
seen.
sent
sentence
sentence:
set
seven
seven.
shall
share
sharp.
she
shill
shirt
shoe/a
shoes.
should
silly!
simple
since
sister
sisters
sit
six,
six.
size
sky.
slice
slippers
slippers.
slippers/a
slower.
slowly,
small
smell,
smoke?
so
socks
some
somehow
something
something.
soon
sooner
sore
sorry
sorry.
sound
soup.
soup/a
speaker’s
spell
spoken
start
starts
station?
stay
stay.
staying
step.
stress
strong.
students
study
sub-sentence
such
sugar/a
suggest
suggestion?
sure.
sure?
table
table.
table?
take
take?
taken
takes
talk
talking
talking.
tall
taxi
tea/two
teach
teachers
teaching
teeth.
telegram
telephone
tell
ten
tenants.
tend
tennis.
tense
than
that
that!
that?
the
there
there,
there.
there?
these
these?
they
they?
thing
things
things.
think
thinking
thirsty.
this
this.
this?
those
those?
three
throat/heart
tie
tie.
till
time
time.
to
to?
today?
today’s
tomatoes.
tomorrow.
too
too)
too.
toothache.
train
tree
tree.
trip,
trouble/a
trouble/liver
trouser.
trying
turn
two
uncle
under
underclothes,
understand
understand?
understood
unless
until
up
up!
up.
upstairs!)
us.
use
useful
vase
verb
verbs.
very
virtual
visit
voice,
waiting
want
was
was,
watch
water
water)
water?
way
we
weak.
wear
weed
week.
weekend
well
went
were
were,
were;
we’ll
we’ve
what
what,
where,
which
which,
who
who,
why,
will
win
window,
window.
wish
with
wonderful.
won’t
wood?
words
words.
work
work.
working
working,
working.
worry
would
writing
writing.
wrote
yard
yesterday.
you
you)
you.
you?
you?)
young
younger
your
yourself
you’ve
‘to
‘undershirt’
‘vest’
“How”
“Treasure
“w”:
铅笔
